---
kind: property
id: P:Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.Depth
source: html/7078a602-eb3e-3113-4ae6-1d687b2bd10f.htm
---
# Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.Depth Property

The depth of the roof or floor slab.

## Syntax (C#)
```csharp
public double Depth { get; }
```

## Remarks
The depth is the thickness of the slab as measured perpendicular to the slab's main faces,
 as opposed to the vertical extrusion distance.